{
  "title": "2025-05-13",
  "content": "I was actually watching Professor Rosi Braidotti's lectures and one of her quotes serves as a good starting point: \"We are already posthuman since the agricultural revolution began.\" From the earliest tools to the domestication of plants and animals, humans have actively reshaped their environment and their own existence.\n\nMy take on transhumanism is inspired in part by Slavoj Žižek. For ease of discussion, we may divide human augmentation into three interconnected levels: the social, the individual, and the sub-individual.\n\nAt the social level, humans have been modifying the substrate available to them since their inception. The plant and animal kingdoms have been significantly shaped by human effort and selective breeding. This process has led to the creation of complex social structures and ecological relationships, demonstrating humanity's capacity to alter the course of evolution itself. Humankind has metaphorically consumed what it sowed and reaped the benefits of the systems it created: improved health, increased longevity, and greater survival success.\n\nHumans have also, since time immemorial, augmented themselves in response to survival challenges. Effectively, using external stimuli or matter to our own benefit counts as intrinsic intelligent activity. A typical example is the fact that I wear eyeglasses in order to see properly. In general, we use technology to transcend our biological constraints.\n\nAt the sub-individual level, we are now confronted with the innumerable possibilities of manipulating the human genome and understanding the neurochemical basis of behavior. The ability to influence our mental and physical states is not entirely new; humans have always engaged in activities that alter their neurochemistry, such as social interaction, physical exercise, and the use of psychoactive substances. However, the direct manipulation of these processes through targeted interventions represents a significant qualitative advancement. This ability to intervene directly at the biological level justifies its classification as a distinct category.\n\nŽižek explores the philosophical implications of technologically mediated experience. He raises the question of what constitutes an \"experience\" when it can be artificially induced or delivered, such as the implantation of false memories or the direct stimulation of brain regions associated with specific emotions. This blurring of the line between authentic and artificial experience challenges our understanding of consciousness, identity, and reality itself.\n\nHere is my interpretation: The social level has evolved complex \"source-sink mechanisms.\" These mechanisms, evident in cultural narratives (such as the pursuit of shared archetypes) and biological processes (such as neurotransmitter regulation), serve to maintain a dynamic equilibrium within individuals and societies. The core dilemma posed by transhumanism is the potential replacement of these evolved mechanisms with artificial inputs, mostly driven by individual desires or market forces. This substitution raises profound ethical questions about the long-term consequences for human well-being.\n\nThe central question remains: where do we draw the line? Rapid advancements in gene editing and biocomputing herald uncontrollable progress. Do they pose an existential threat? We face the challenge of distinguishing between gradual, iterative enhancements and sudden, radical changes that could fundamentally alter what it means to be human. As Francis Fukuyama warned: 'The environmental movement has taught us humility and respect for the integrity of nonhuman nature. We need a similar sense of humility concerning our human nature.'\n\nBeing the fool I am, I am highly optimistic about progress. Since there is a certain business appeal to this kind of progress, applying brakes would only result in an artificial delay. Instead, this evolution can open new avenues for human equality and equity. This is in stark contrast with what I observe as a reader most of the time: The looming threat of a few companies taking over the world or an AGI entity taking over. To me, this is pointless. To be able to think like a human being inherently implies optimism. This suggests a recursive self-reference regarding the very definition of humanity.\n\nThat said, I do not relate to purely physicalist conceptions of the universe, such as the idea of a future \"computronium\" substrate (turning all matter into computing power) as an end in itself. That is an efficiency maximization trap, devoid of the human element.\n\nInstead, I am much more interested in the Marxist connotations of transhumanism. In this view, the \"means of production\" extends beyond factories to the biological substrate itself. If transhumanism remains driven solely by market forces, it risks commodifying the human experience, turning our very biology into a product of class stratification. However, if taken as a means of liberation rather than a consumerist end, it points to a direction yet unclear but potentially emancipatory. It suggests a future where we seize control of our evolutionary history not to become more efficient machines, but to expand the scope of our freedom. I strongly believe we have a lot to uncover on the phenomenological front i.e how these changes will feel, not just how they will function. More on this later. Disagreements are welcome!",
  "date": "On Transhumanism: The Biological Source, Sink and Silicon",
  "slug": "2025-05-13",
  "readTime": 5,
  "wordCount": 806
}